Gloryfy/NFC/S32K116 + NCF3320/NxpNfcRdLib/intfs/phhalHw_Ncx3320_Reg.h
/*
*         Copyright (c), NXP Semiconductors Gratkorn / Austria
*
*                     (C)NXP Semiconductors
*       All rights are reserved. Reproduction in whole or in part is
*      prohibited without the written consent of the copyright owner.
*  NXP reserves the right to make changes without notice at any time.
* NXP makes no warranty, expressed, implied or statutory, including but
* not limited to any implied warranty of merchantability or fitness for any
*particular purpose, or that the use will not infringe any third party patent,
* copyright or trademark. NXP must not be liable for any loss or damage
*                          arising from its use.
*/

/** \file
* Ncx3320 register definitions for Reader Library Framework.
* $Author$
* $Revision$ (v05.22.00)
* $Date$
*
* History:
*  CHu: Generated 19. November 2009
*
*/

#ifndef PHHALHW_NCx3320_REG_H
#define PHHALHW_NCx3320_REG_H

#include <ph_Status.h>

#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus */

#ifdef NXPBUILD__PHHAL_HW_NCx3320

/** \defgroup phhalHw_Ncx3320_Reg Register Definitions
* \brief Register definitions.
* @{
*/

/** \brief Command Register.
*
* Used for starting / stopping commands and for sending the IC into standby mode.
*/
#define PHHAL_HW_NCx3320_REG_COMMAND              0x00U

/** \brief Host-Control Register.
*
* Configure Host and SAM interfaces.
*/
#define PHHAL_HW_NCx3320_REG_HOSTCTRL             0x01U

/** \name Fifo Registers
*/
/*@{*/
/** \brief FIFO-Control Register.
*
* Set FIFO size and retrieve FIFO parameters.\n
* \b Note: Also contains 1 additional Water-Level bit (MSB) and 2 additional FIFO-Length bits (also MSB).
*/
#define PHHAL_HW_NCx3320_REG_FIFOCONTROL          0x02U

/** \brief WaterLevel Register.
*
* FIFO WaterLevel configuration.
*/
#define PHHAL_HW_NCx3320_REG_WATERLEVEL           0x03U

/** \brief FIFO-Length Register.
*
* Retrieve the number of bytes within the FIFO.
*/
#define PHHAL_HW_NCx3320_REG_FIFOLENGTH           0x04U

/** \brief FIFO-Data Register.
*
* Writing to this register moves a byte into the FIFO
* while incrementing the FIFO length and raising the internal WaterLevel.
*/
#define PHHAL_HW_NCx3320_REG_FIFODATA             0x05U
/*@}*/

/** \name IRQ Registers
*/
/*@{*/
/** \brief IRQ0 Register.
*
* Read or modify the first 7 IRQ bits.
*/
#define PHHAL_HW_NCx3320_REG_IRQ0                 0x06U

/** \brief IRQ1 Register.
*
* Read or modify the second 7 IRQ bits.
*/
#define PHHAL_HW_NCx3320_REG_IRQ1                 0x07U

/** \brief IRQ0EN Register.
*
* Enable or disable the first IRQ bits or invert the IRQ propagation.
*/
#define PHHAL_HW_NCx3320_REG_IRQ0EN               0x08U

/** \brief IRQ1EN Register.
*
* Enable or disable the second IRQ bits or enable/disable PushPull mode.
*/
#define PHHAL_HW_NCx3320_REG_IRQ1EN               0x09U
/*@}*/

/** \brief Error Register.
*
* Contains bits for the occured erros.
*/
#define PHHAL_HW_NCx3320_REG_ERROR                0x0AU

/** \brief Status Register.
*
* Contains the Crypto1 state and information about the ComState.
*/
#define PHHAL_HW_NCx3320_REG_STATUS               0x0BU

/** \brief Rx-Bit-Control Register.
*
* Set/Get Bit-granularity and collision information.
*/
#define PHHAL_HW_NCx3320_REG_RXBITCTRL            0x0CU

/** \brief Rx-Coll Register.
*
* Contains information about the collision position after a collision.
*/
#define PHHAL_HW_NCx3320_REG_RXCOLL               0x0DU

/** \name Timer Registers
*/
/*@{*/
/** \brief Timer Control Register.
*
* Provides timer control and status information for all timers.
*/
#define PHHAL_HW_NCx3320_REG_TCONTROL             0x0EU

/** \brief Timer0 Control Register.
*
* Configure the timer.
*/
#define PHHAL_HW_NCx3320_REG_T0CONTROL            0x0FU

/** \brief Timer0 Reload(High) Register.
*
* Set the most significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T0RELOADHI           0x10U

/** \brief Timer0 Reload(Low) Register.
*
* Set the least significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T0RELOADLO           0x11U

/** \brief Timer0 Counter(High) Register.
*
* Get the most significant byte of the Counter-Value.
*/
#define PHHAL_HW_NCx3320_REG_T0COUNTERVALHI       0x12U

/** \brief Timer0 Counter(Low) Register.
*
* Get the least significant byte of the Counter-Value.
*/
#define PHHAL_HW_NCx3320_REG_T0COUNTERVALLO       0x13U

/** \brief Timer1 Control Register.
*
* Configure the timer.
*/
#define PHHAL_HW_NCx3320_REG_T1CONTROL            0x14U

/** \brief Timer1 Reload(High) Register.
*
* Set the most significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T1RELOADHI           0x15U

/** \brief Timer1 Reload(Low) Register.
*
* Set the least significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T1RELOADLO           0x16U

/** \brief Timer1 Counter(High) Register.
*
* Get the most significant byte of the Counter-Value.
*/
#define PHHAL_HW_NCx3320_REG_T1COUNTERVALHI       0x17U

/** \brief Timer1 Counter(Low) Register.
*
* Get the least significant byte of the Counter-Value.
*/
#define PHHAL_HW_NCx3320_REG_T1COUNTERVALLO       0x18U

/** \brief Timer2 Control Register.
*
* Configure the timer.
*/
#define PHHAL_HW_NCx3320_REG_T2CONTROL            0x19U

/** \brief Timer2 Reload(High) Register.
*
* Set the most significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T2RELOADHI           0x1AU

/** \brief Timer2 Reload(Low) Register.
*
* Set the least significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T2RELOADLO           0x1BU

/** \brief Timer2 Counter(High) Register.
*
* Get the most significant byte of the Counter-Value.
*/
#define PHHAL_HW_NCx3320_REG_T2COUNTERVALHI       0x1CU

/** \brief Timer2 Counter(Low) Register.
*
* Get the least significant byte of the Counter-Value.
*/
#define PHHAL_HW_NCx3320_REG_T2COUNTERVALLO       0x1DU

/** \brief Timer3 Control Register.
*
* Configure the timer.
*/
#define PHHAL_HW_NCx3320_REG_T3CONTROL            0x1EU

/** \brief Timer3 Reload(High) Register.
*
* Set the most significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T3RELOADHI           0x1FU

/** \brief Timer3 Reload(Low) Register.
*
* Set the least significant byte of the Reload-Value.
*/
#define PHHAL_HW_NCx3320_REG_T3RELOADLO           0x20U

