Gloryfy/NFC/S32K116 + NCF3320/NxpNfcRdLib/intfs/phhalHw_Ncx3320_Reg.h
/** \name IRQ0 Register(s) Contents (0x06/0x08)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_SET                  0x80U
#define PHHAL_HW_NCx3320_BIT_IRQINV               0x80U
#define PHHAL_HW_NCx3320_BIT_HIALERTIRQ           0x40U
#define PHHAL_HW_NCx3320_BIT_LOALERTIRQ           0x20U
#define PHHAL_HW_NCx3320_BIT_IDLEIRQ              0x10U
#define PHHAL_HW_NCx3320_BIT_TXIRQ                0x08U
#define PHHAL_HW_NCx3320_BIT_RXIRQ                0x04U
#define PHHAL_HW_NCx3320_BIT_ERRIRQ               0x02U
#define PHHAL_HW_NCx3320_BIT_EMDIRQ               0x01U
/*@}*/

/** \name IRQ1 Register(s) Contents (0x07/0x09)
*/
/*@{*/
/* #define PHHAL_HW_NCx3320_BIT_SET                  0x80U */
#define PHHAL_HW_NCx3320_BIT_IRQPUSHPULL          0x80U
#define PHHAL_HW_NCx3320_BIT_GLOBALIRQ            0x40U
#define PHHAL_HW_NCx3320_BIT_IRQPINEN             0x40U
#define PHHAL_HW_NCx3320_BIT_LPCDIRQ              0x20U
#define PHHAL_HW_NCx3320_BIT_TIMER4IRQ            0x10U
#define PHHAL_HW_NCx3320_BIT_TIMER3IRQ            0x08U
#define PHHAL_HW_NCx3320_BIT_TIMER2IRQ            0x04U
#define PHHAL_HW_NCx3320_BIT_TIMER1IRQ            0x02U
#define PHHAL_HW_NCx3320_BIT_TIMER0IRQ            0x01U
/*@}*/

/** \name Error Register Contents (0x0A)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_EE_ERR               0x80U
#define PHHAL_HW_NCx3320_BIT_FIFOWRERR            0x40U
#define PHHAL_HW_NCx3320_BIT_FIFOOVL              0x20U
#define PHHAL_HW_NCx3320_BIT_MINFRAMEERR          0x10U
#define PHHAL_HW_NCx3320_BIT_NODATAERR            0x08U
#define PHHAL_HW_NCx3320_BIT_COLLDET              0x04U
#define PHHAL_HW_NCx3320_BIT_PROTERR              0x02U
#define PHHAL_HW_NCx3320_BIT_INTEGERR             0x01U
/*@}*/

/** \name Status Register Contents (0x0B)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_CRYPTO1ON            0x20U
#define PHHAL_HW_NCx3320_MASK_COMMSTATE           0x07U
/*@}*/

/** \name Rx-Bit-Control Register Contents (0x0C)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_VALUESAFTERCOLL      0x80U
#define PHHAL_HW_NCx3320_BIT_NOCOLL               0x08U
#define PHHAL_HW_NCx3320_MASK_RXALIGN             0x70U
#define PHHAL_HW_NCx3320_MASK_RXLASTBITS          0x07U
/*@}*/

/** \name Rx-Coll Register Contents (0x0D)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_COLLPOSVALID         0x80U
#define PHHAL_HW_NCx3320_MASK_COLLPOS             0x7FU
/*@}*/

/** \name Timer-Control Register Contents (0x0E)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_T3RUNNING            0x80U
#define PHHAL_HW_NCx3320_BIT_T2RUNNING            0x40U
#define PHHAL_HW_NCx3320_BIT_T1RUNNING            0x20U
#define PHHAL_HW_NCx3320_BIT_T0RUNNING            0x10U
#define PHHAL_HW_NCx3320_BIT_T3STARTSTOPNOW       0x08U
#define PHHAL_HW_NCx3320_BIT_T2STARTSTOPNOW       0x04U
#define PHHAL_HW_NCx3320_BIT_T1STARTSTOPNOW       0x02U
#define PHHAL_HW_NCx3320_BIT_T0STARTSTOPNOW       0x01U
/*@}*/

/** \name T[0-3]-Control Register Contents (0x0F/0x14/0x19/0x1E)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_TSTOP_RX             0x80U   /**< Stop timer on receive interrupt. */
#define PHHAL_HW_NCx3320_BIT_TAUTORESTARTED       0x08U   /**< Auto-restart timer after underflow. */
#define PHHAL_HW_NCx3320_BIT_TSTART_TX            0x10U   /**< Start timer on transmit interrupt. */
#define PHHAL_HW_NCx3320_BIT_TSTART_LFO           0x20U   /**< Use this timer for LFO trimming. */
#define PHHAL_HW_NCx3320_BIT_TSTART_LFO_UV        0x30U   /**< Use this timer for LFO trimming (generate UV at a trimming event). */
#define PHHAL_HW_NCx3320_MASK_TSTART              0x30U   /**< Mask for TSTART bits. */
#define PHHAL_HW_NCx3320_VALUE_TCLK_1356_MHZ      0x00U   /**< Use 13.56MHz as input clock. */
#define PHHAL_HW_NCx3320_VALUE_TCLK_212_KHZ       0x01U   /**< Use 212KHz as input clock. */
#define PHHAL_HW_NCx3320_VALUE_TCLK_T0            0x02U   /**< Use timer0 as input clock. */
#define PHHAL_HW_NCx3320_VALUE_TCLK_T1            0x03U   /**< Use timer1 as input clock. */
/*@}*/

/** \name T4-Control Register Contents (0x23)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_T4RUNNING            0x80U
#define PHHAL_HW_NCx3320_BIT_T4STARTSTOPNOW       0x40U
#define PHHAL_HW_NCx3320_BIT_T4AUTOTRIMM          0x20U
#define PHHAL_HW_NCx3320_BIT_T4AUTOLPCD           0x10U
#define PHHAL_HW_NCx3320_BIT_T4AUTORESTARTED      0x08U
#define PHHAL_HW_NCx3320_BIT_T4AUTOWAKEUP         0x04U
/*#define PHHAL_HW_NCx3320_MASK_TSTART              0x30U*/
#define PHHAL_HW_NCx3320_VALUE_TCLK_LFO_16_KHZ    0x00U
#define PHHAL_HW_NCx3320_VALUE_TCLK_LFO_2_KHZ     0x01U
#define PHHAL_HW_NCx3320_VALUE_TCLK_LFO_1_KHZ     0x02U
#define PHHAL_HW_NCx3320_VALUE_TCLK_LFO_500_HZ    0x03U
/*@}*/

/** \name Driver Mode Register Contents (0x28)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_TX2INV               0x80U
#define PHHAL_HW_NCx3320_BIT_TX1INV               0x40U
#define PHHAL_HW_NCx3320_BIT_TXEN                 0x08U
#define PHHAL_HW_NCx3320_BIT_RFON                 0x04U
#define PHHAL_HW_NCx3320_BIT_TPUSHON              0x02U
#define PHHAL_HW_NCx3320_BIT_TPULLON              0x01U
/*@}*/

/** \name Tx Amplifier Register Contents (0x29)
*/
/*@{*/
#define PHHAL_HW_NCx3320_MASK_CW_AMPLITUDE        0xC0U
#define PHHAL_HW_NCx3320_MASK_RESIDUAL_CARRIER    0x1FU
/*@}*/

/** \name Driver Control Register Contents (0x2A)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_CWMAX                0x10U
#define PHHAL_HW_NCx3320_BIT_DISOVSHTPREV         0x08U
#define PHHAL_HW_NCx3320_BIT_DRIVERINV            0x04U
#define PHHAL_HW_NCx3320_VALUE_DRIVERSEL_LOW      0x00U
#define PHHAL_HW_NCx3320_VALUE_DRIVERSEL_TXENV    0x01U
#define PHHAL_HW_NCx3320_VALUE_DRIVERSEL_SIGIN    0x02U
/*@}*/

/** \name TxI Control Register Contents (0x2B)
*/
/*@{*/
#define PHHAL_HW_NCx3320_MASK_TXILOAD             0xF0U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_00         0x00U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_01         0x01U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_02         0x02U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_03         0x03U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_04         0x04U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_05         0x05U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_06         0x06U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_07         0x07U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_08         0x08U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_09         0x09U
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_10         0x0AU
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_11         0x0BU
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_12         0x0CU
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_13         0x0DU
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_14         0x0EU
#define PHHAL_HW_NCx3320_VALUE_TXILOAD_15         0x0FU
/*@}*/

