Gloryfy/NFC/S32K116 + NCF3320/NxpNfcRdLib/intfs/phhalHw_Ncx3320_Reg.h
/** \name Tx-/Rx-CRC Control Register Contents (0x2C/0x2D)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_RXFORCECRCWRITE      0x80U
#define PHHAL_HW_NCx3320_BIT_CRCINVERT            0x02U
#define PHHAL_HW_NCx3320_BIT_CRCEN                0x01U
#define PHHAL_HW_NCx3320_MASK_CRCPRESETVAL        0x70U
#define PHHAL_HW_NCx3320_MASK_CRCTYPE             0x0CU
#define PHHAL_HW_NCx3320_MASK_CRCTYPE5            0x00U
#define PHHAL_HW_NCx3320_MASK_CRCTYPE16           0x08U
/*@}*/

/** \name Tx-DataNum Register Contents (0x2E)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_KEEPBITGRID          0x10U
#define PHHAL_HW_NCx3320_BIT_DATAEN               0x08U
#define PHHAL_HW_NCx3320_MASK_TXLASTBITS          0x07U
#define PHHAL_HW_NCx3320_MASK_SYMBOL_SEND         0x08U
/*@}*/

/** \name Tx-Wait Control Register Contents (0x31)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_TXWAIT_START_RX      0x80U
#define PHHAL_HW_NCx3320_BIT_TXWAIT_DBFREQ        0x40U
#define PHHAL_HW_NCx3320_MASK_TXWAITHI            0x38U
#define PHHAL_HW_NCx3320_MASK_TXSTOPBITLEN        0x07U
/*@}*/

/** \name Frame Control Register Contents (0x33)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_TXPARITYEN           0x80U
#define PHHAL_HW_NCx3320_BIT_RXPARITYEN           0x40U
#define PHHAL_HW_NCx3320_VALUE_STOP_SYM3          0x0CU
#define PHHAL_HW_NCx3320_VALUE_STOP_SYM2          0x08U
#define PHHAL_HW_NCx3320_VALUE_STOP_SYM1          0x04U
#define PHHAL_HW_NCx3320_VALUE_START_SYM2         0x03U
#define PHHAL_HW_NCx3320_VALUE_START_SYM1         0x02U
#define PHHAL_HW_NCx3320_VALUE_START_SYM0         0x01U
#define PHHAL_HW_NCx3320_MASK_STARTSYM            0x03U
#define PHHAL_HW_NCx3320_MASK_STOPSYM             0x0CU
/*@}*/

/** \name Rx Control Register Contents (0x35)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_RXALLOWBITS          0x80U
#define PHHAL_HW_NCx3320_BIT_RXMULTIPLE           0x40U
#define PHHAL_HW_NCx3320_BIT_RXEOFTYPE            0x20U
#define PHHAL_HW_NCx3320_BIT_EGT_CHECK            0x10U
#define PHHAL_HW_NCx3320_BIT_EMD_SUPPRESSION      0x08U
#define PHHAL_HW_NCx3320_MASK_RXBAUDRATE          0x07U
/*@}*/

/** \name Rx-Wait Register Contents (0x36)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_RXWAITDBFREQ         0x80U
#define PHHAL_HW_NCx3320_MASK_RXWAIT              0x7FU
/*@}*/

/** \name Rx-Threshold Register Contents (0x37)
*/
/*@{*/
#define PHHAL_HW_NCx3320_MASK_MINLEVEL            0xF0U
#define PHHAL_HW_NCx3320_MASK_MINLEVELP           0x0FU
/*@}*/

/** \name Rx-Receiver Register Contents (0x38)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_RX_SINGLE            0x80U
#define PHHAL_HW_NCx3320_BIT_RX_SHORT_MIX2ADC     0x40U
#define PHHAL_HW_NCx3320_BIT_USE_SMALL_EVAL       0x04U
#define PHHAL_HW_NCx3320_MASK_RX_SIGPRO_IN_SEL    0x30U
#define PHHAL_HW_NCx3320_MASK_COLLLEVEL           0x03U
/*@}*/

/** \name Rx-Analog Register Contents (0x39)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_RX_OC_ENABLE         0x20U
#define PHHAL_HW_NCx3320_BIT_RX_HP_LOWF           0x10U
#define PHHAL_HW_NCx3320_MASK_VMID_R_SEL          0xC0U
#define PHHAL_HW_NCx3320_MASK_RCV_HPCF            0x0CU
#define PHHAL_HW_NCx3320_MASK_RCV_GAIN            0x03U
/*@}*/

/** \name Lpcd Option Register Contents (0x3A)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_LPCD_I_UNSTABLE      0x01U
#define PHHAL_HW_NCx3320_BIT_LPCD_Q_UNSTABLE      0x02U
#define PHHAL_HW_NCx3320_BIT_LPCD_FILTER          0x04U
#define PHHAL_HW_NCx3320_BIT_LPCD_CHARGEPUMP      0x08U
/*@}*/

/** \name Serial-Speed Register Contents (0x3B)
*/
/*@{*/
#define PHHAL_HW_NCx3320_MASK_BR_T0               0xE0U
#define PHHAL_HW_NCx3320_MASK_BR_T1               0x1FU
/*@}*/


/** \name LPCD Result(Q) Register Contents (0x43)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_LPCDIRQ_CLR          0x40U
/*@}*/

/** \name Tx-BitMod Register Contents (0x48)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_TXMSBFIRST           0x80U
#define PHHAL_HW_NCx3320_BIT_TXPARITYTYPE         0x20U
#define PHHAL_HW_NCx3320_BIT_TXSTOPBITTYPE        0x08U
#define PHHAL_HW_NCx3320_BIT_TXSTARTBITTYPE       0x02U
#define PHHAL_HW_NCx3320_BIT_TXSTARTBITEN         0x01U
/*@}*/

/** \name Rx-BitMod Register Contents (0x58)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_RXSTOPONINVPAR       0x20U
#define PHHAL_HW_NCx3320_BIT_RXSTOPONLEN          0x10U
#define PHHAL_HW_NCx3320_BIT_RXMSBFIRST           0x08U
#define PHHAL_HW_NCx3320_BIT_RXSTOPBITEN          0x04U
#define PHHAL_HW_NCx3320_BIT_RXPARITYTYPE         0x02U
/*@}*/

/** \name Rx-Mod Register Contents (0x5D)
*/
/*@{*/
#define PHHAL_HW_NCx3320_BIT_PREFILTER            0x20U
#define PHHAL_HW_NCx3320_BIT_RECTFILTER           0x10U
#define PHHAL_HW_NCx3320_BIT_SYNCHIGH             0x08U
#define PHHAL_HW_NCx3320_BIT_CORRINV              0x04U
#define PHHAL_HW_NCx3320_BIT_FSK                  0x02U
#define PHHAL_HW_NCx3320_BIT_BPSK                 0x01U
/*@}*/

/**
* \brief Write to 8bit address of CL front-end register.
*
* \return Status code
* \retval #PH_ERR_SUCCESS Operation successful.
* \retval #PH_ERR_INTERFACE_ERROR Hardware problem
*/
phStatus_t phhalHw_Ncx3320_WriteRegister(
                                       phhalHw_Ncx3320_DataParams_t * pDataParams, /**< [In] Pointer to this layer's parameter structure. */
                                       uint8_t bAddress,                         /**< [In] Register Address. */
                                       uint8_t bValue                            /**< [In] Register Value. */
                                       );

/**
* \brief Read 8bit register address from CL front-ends.
*
* \return Status code
* \retval #PH_ERR_SUCCESS Operation successful.
* \retval #PH_ERR_INTERFACE_ERROR Hardware problem
*/
phStatus_t phhalHw_Ncx3320_ReadRegister(
                                      phhalHw_Ncx3320_DataParams_t * pDataParams, /**< [In] Pointer to this layer's parameter structure. */
                                      uint8_t bAddress,                         /**< [In] Register Address. */
                                      uint8_t * pValue                          /**< [Out] Register Value. */
                                      );

/** @}
* end of phhalHw_Ncx3320_Reg group
*/
#endif /* NXPBUILD__PHHAL_HW_NCx3320 */

#ifdef __cplusplus
} /* Extern C */
#endif

#endif /* PHHALHW_NCx3320_REG_H */
